{
  "2024": [
    {
      "name": "Destin Mizelle",
      "title": "Counseling Psychology Ph.D. Canditate",
      "bio": "Destin is a fourth-year Counseling Psychology Ph.D. candidate from College Park, GA. Destin's research interests broadly include racial socialization, social justice, mental health disparities in Black communities, and Black American cultural appreciation. Specifically, Destin is interested in celebrating African American naming patterns and examining the psychological effects of bearing Black Sounding Names. Through the lens of Liberation Psychology, and interdisciplinary collaboration, Destin's primary goal is to improve Black Americans' spiritual, physical, and mental well-being while appreciating their traditions, culture, and history.",
      "headshot": "Data/2024/headshots/destin_mizelle_headshot.jpeg",
      "videoId": "25xOclDOV_U",
      "start": 4333,
      "end": 5435
    },
    {
      "name": "Hannah Drake",
      "title": "Poet, (Un)Known Project, Co-Founder",
      "bio": "Hannah Drake is an author, activist, poet, and public speaker. She co-founded (Un)Known Project, which works to unearth hidden names and stories of Black people enslaved in America and the global African diaspora. She writes commentary on politics, feminism, and race, and her writing has been featured online at Cosmopolitan, The Washington Post, The Bitter Southerner, The Lily, and Harper’s Bazaar. Hannah was selected as a Soros Equality Fellow as an individual who they believe will become a long-term innovative leader impacting racial justice. Recently, Hannah was inducted into the Kentucky Women Remembered exhibit which seeks to honor outstanding women who have made significant contributions to Kentucky’s history. Hannah’s message is thought-provoking and at times challenging, however, she believes that it is in uncomfortable spaces that change can take place. “My sole purpose in writing and speaking is not to entertain you. I am trying to shake a nation.”",
      "headshot": "Data/2024/headshots/hannah_drake_headshot.png",
      "videoId": "25xOclDOV_U",
      "start": 12465,
      "end": 13216
    },
    {
      "name": "Joseph Thacker",
      "title": "Principal AI Engineer, Security Researcher",
      "bio": "Joseph Thacker is a Principal AI Engineer at AppOmni as well as a security researcher who specializes in application security and AI. He has helped Fortune 500 companies find vulnerabilities that could have cost them millions, and has submitted over 1,000 vulnerabilities across Hackerone and Bugcrowd. He loves helping secure the planet by building and breaking systems. On a more personal level, he is a Christian, husband, father, and hacker. He loves most things in life, but is particularly fond of hacking, ai-art, running, podcasts, and keylime pie.",
      "headshot": "Data/2024/headshots/joseph_thacker_headshot.jpeg",
      "videoId": "25xOclDOV_U",
      "start": 10360,
      "end": 10954
    },
    {
      "name": "Nigel Marcellus Taylor",
      "title": "PhD Candidate, Talk Show Host, Children's Book Author",
      "bio": "Nigel Marcellus Taylor is an up & coming talk show host who centralizes Black voices, mental health, relationships, and healing. He is also a PhD Candidate at the University of Kentucky studying Communication. Nigel utilizes his academic research, charisma, and emotional intelligence to have meaningful conversations about vulnerable topics. He thrives in creating community and a safe environment for people to authentically express themselves while simultaneously feeling affirmed and validated in who they are. In addition, Nigel is the author of the children's book “The Endless Possibilities of Nora and Vincent” which debuted as the #3 Best Seller in Children’s Philosophy Books on Amazon.",
      "headshot": "Data/2024/headshots/nigel_marcellus_headshot.JPG",
      "videoId": "25xOclDOV_U",
      "start": 11383,
      "end": 12421
    },
    {
      "name": "Shannon Sauer-Zavala, PhD",
      "title": "Associate Professor of Clinical Psychology, Author",
      "bio": "Dr. Sauer-Zavala is a licensed clinical psychologist and an internationally respected expert on personality change. As a researcher at the University of Kentucky, she runs clinical trials testing cutting-edge interventions that harness the power of personality change to alleviate common mental health conditions. She has co-authored over 120 peer-reviewed articles and book chapters, along with treatment manuals and an academic book on personality. Her research has been supported by the National Institute of Mental Health (NIMH), the Canadian Institute of Health Research, and the Templeton Foundation. Dr. Sauer-Zavala is passionate about helping others understand the science of personality change in order to cultivate the careers and relationships they want.",
      "headshot": "Data/2024/headshots/shannon_sauer-zavala_headshot.jpeg",
      "videoId": "25xOclDOV_U",
      "start": 3046,
      "end": 4112
    },
    {
      "name": "Shereen Thor",
      "title": "Founder, Keynote Speaker",
      "bio": "Shereen Thor is a comedian turned coach who slays with hope and humor. She has shared the stage with greats like Serena Williams, Prince Harry, Pau Gasol, and Les Brown. She is also the bestselling author of Revolutionary Woman, which focuses on inspiring women and people of color to revolutionize how they see themselves to create a more equitable world. She has been featured in Forbes, TEDx, The Wall Street Journal, Insider, Medium, Spike TV, 97.1 AMP Radio, and more. When she isn’t working, she is enjoying the great outdoors, spending time with her family, coaching or playing soccer, enjoying good food with friends and leaving her cell phone in the dust for extended periods.",
      "headshot": "Data/2024/headshots/shereen_thor_headshot.png",
      "videoId": "25xOclDOV_U",
      "start": 5605,
      "end": 6577
    },
    {
      "name": "the artist ATB",
      "title": "Metamodern Artist, Creator of SOULED",
      "bio": "With his lifelong, time-based work of art called SOULED, the artist ATB conspires with audiences to foreground context as the origin of meaning and value. SOULED is an evolving project that fuses performance and visual art through time. It’s created in editions of 12 prints that double in value as they sell, ranging from a few dollars in the beginning to several thousand by the end. But any works unsold after 12 days are immolated in a recorded performance. His talk explains how appropriating context transforms our perception of art and life. Using personal narrative, famous works of art, and SOULED itself, the artist ATB explores the creation of meaning and value within our brief allotment of time.",
      "headshot": "Data/2024/headshots/the_artistATB_headshot.jpeg",
      "videoId": "25xOclDOV_U",
      "start": 1600,
      "end": 2740
    }
  ],
  "2025": [
    {
      "name": "Adria Thompson",
      "title": "Speech-Language Pathologist",
      "bio": "Adria Thompson, MA, CCC-SLP, is a speech-language pathologist and lecturer in the Communication Disorders program at Eastern Kentucky University. With 10 years of experience in long-term care communities, she specializes in dementia education and caregiver support. As the founder of Be Light Care Consulting, Adria has created over 500 educational videos that provide practical, evidence-based strategies to improve dementia care. Her social media platforms have grown to over 400,000 followers, offering compassionate and accessible education to help families navigate the challenges of dementia.",
      "headshot": "Data/2025/headshots/adria_thompson_headshot.jpeg",
      "videoId": "25xOclDOV_U",
      "start": 60,
      "end": 100
    },
    {
      "name": "Christal Badour",
      "title": "Clinical Psychologist",
      "bio": "Dr. Christal Badour is a clinical psychologist, researcher, educator, and staunch advocate for survivors of violence and other forms of trauma. She co-founded the University of Kentucky Clinic for Emotional Health, which offers free science-backed therapy in line with the value that all people should have access to the highest quality mental health care, regardless of their identity, culture, geographical location, insurance status, or ability to pay. Dr. Badour uses her platform as an Associate Professor to support the next generation of young clinicians, scholars, and activists to develop the tools necessary to challenge systems that perpetuate violence and create barriers to recovery.",
      "headshot": "Data/2025/headshots/christal_badour_headshot.jpeg",
      "videoId": "25xOclDOV_U",
      "start": 60,
      "end": 100
    },
    {
      "name": "David Hague",
      "title": "Director of the Community Mental Health Clinic",
      "bio": "Dr. David Pascale Hague earned his PhD in Counseling Psychology from the University of Kentucky in 2015. He is an assistant professor in Counseling Psychology and is the Director of the Community Mental Health Clinic in the College of Education. Dr. Hague teaches ethics, practicum, and psychopathology courses for master’s and doctoral students. He is a licensed psychologist in Kentucky, maintains a small private practice, and sits on the board of the Kentucky Psychological Foundation. Additionally, he is the current liaison for LGBTQIA issues with APA Division 31 (State, Provincial, and Territorial Associations). Dr. Pascale Hague’s clinical and research interests focus on working with sexual, relationship, and gender minority groups.",
      "headshot": "Data/2025/headshots/david_hague_headshot.jpeg",
      "videoId": "25xOclDOV_U",
      "start": 60,
      "end": 100
    },
    {
      "name": "L. Sebastian Bryson",
      "title": "Department Chair of Civil Engineering",
      "bio": "Dr. L. Sebastian Bryson is the current Hardin-Drnevich-Huang Professor of Civil Engineering in the Department of Civil Engineering with a joint appointment in the Department of Earth and Environmental Sciences at the University of Kentucky. Dr. Bryson is also the current Department Chair for the Department of Civil Engineering. Dr. Bryson’s current research interests focus on landslide geohazard assessment and prediction, and multi-hazard response of infrastructure systems. Dr Bryson is a Fellow in the American Society of Civil Engineers. Dr. Bryson is also a Board-Certified Geotechnical Engineer by the Academy of Geo-Professionals. Dr Bryson received his Ph.D. from Northwestern University, his Master of Engineering degree from Howard University, and his Bachelor of Science degree from Florida A&M University. Dr. Bryson is a registered professional engineer in six states.",
      "headshot": "Data/2025/headshots/L.sebastian_bryson_headshot.jpeg",
      "videoId": "25xOclDOV_U",
      "start": 60,
      "end": 100
    },
    {
      "name": "Marc Cormier",
      "title": "Performance Psychologist Specialist",
      "bio": "Dr. Marc Cormier is an award-winning performance psychology specialist with nearly 20 years of experience working in elite environments. He is an Associate Professor and Director of the Sport and Exercise Psychology Graduate Program at the University of Kentucky and serves as the Director of Performance Psychology for UK Athletics. Throughout his career, he has worked with numerous NCAA championship teams, as well as All-American and Olympic athletes/champions. More recently, he has been invited to speak to audiences in various non-sport performance contexts such as surgeons, performance artists, emergency responders, and Fortune 500 leaders.",
      "headshot": "Data/2025/headshots/marc_cormier_headshot.jpeg",
      "videoId": "25xOclDOV_U",
      "start": 60,
      "end": 100
    },
    {
      "name": "Stephen Seidel",
      "title": "Founder of The Seidel Agency",
      "bio": "Stephen Seidel is a motivational speaker, entrepreneur, and founder of the award-winning Seidel Agency, amplifying artists and Fortune 500 changemakers. As a best-selling author, creator of the Top 10 Apple podcast Wolves Among Us, and men's mental health community GentsJourney.co, he is driven by a mission to do good, give back, and make an impact by owning your story. Seidel is originally from Bucks County, PA, and lives in Lexington, KY as a proud #GirlDad. With a BSIE from Penn State, he remains loyal to cheesesteaks, pretzels, and his Super Bowl Champion Philadelphia Eagles.",
      "headshot": "Data/2025/headshots/stephen_seidel_headshot.jpeg",
      "videoId": "25xOclDOV_U",
      "start": 60,
      "end": 100
    }
  ]
}
